# <img style="float: left; padding-right: 100px; width: 300px" src="images/logo.png">Data science Foundation:



#### Module 2B: Combining datasets, Group by and Pivoting  operations


**Authors:** Ibrahim Mtandu


---

In [1]:
import numpy as np
import pandas as pd

# Concatenating data

The ``pd.concat`` function does all of the heavy lifting of combining data in different ways. ``pd.concat`` takes a list or dict of Series/DataFrame objects and concatenates them in a certain direction (`axis`) with some configurable handling of “what to do with the other axes”.

Assume we have the following different:

In [2]:
data = {'country': ['Nigeria', 'Rwanda', 'Egypt', 'Morocco', ],
        'population': [182.2, 11.3, 94.3, 34.4],
        'area': [923768, 26338 , 1010408, 710850],
        'capital': ['Abuja', 'Kigali', 'Cairo', 'Rabat']}
countries_africa = pd.DataFrame(data)
countries_africa

   country  population     area capital
0  Nigeria       182.2   923768   Abuja
1   Rwanda        11.3    26338  Kigali
2    Egypt        94.3  1010408   Cairo
3  Morocco        34.4   710850   Rabat

In [4]:
data = {'country': ['Belgium', 'France', 'Germany', 'Netherlands', 'United Kingdom'],
        'population': [11.3, 64.3, 81.3, 16.9, 64.9],
        'area': [30510, 671308, 357050, 41526, 244820],
        'capital': ['Brussels', 'Paris', 'Berlin', 'Amsterdam', 'London']}
countries_europe = pd.DataFrame(data)
countries_europe

          country  population    area    capital
0         Belgium        11.3   30510   Brussels
1          France        64.3  671308      Paris
2         Germany        81.3  357050     Berlin
3     Netherlands        16.9   41526  Amsterdam
4  United Kingdom        64.9  244820     London

<div class="alert alert-success">
<b>Activity 1</b>:
Add a cloumn for pupulation density in each dataset 
</div>

### Combining rows - ``pd.concat``

We now want to combine the rows of both datasets:

In [5]:
pd.concat([countries_europe, countries_africa])

          country  population     area    capital
0         Belgium        11.3    30510   Brussels
1          France        64.3   671308      Paris
2         Germany        81.3   357050     Berlin
3     Netherlands        16.9    41526  Amsterdam
4  United Kingdom        64.9   244820     London
0         Nigeria       182.2   923768      Abuja
1          Rwanda        11.3    26338     Kigali
2           Egypt        94.3  1010408      Cairo
3         Morocco        34.4   710850      Rabat

When the two dataframes don't have the same set of columns, by default missing values get introduced:

In [13]:
pd.concat([countries_europe, countries_africa[['country','capital']]], sort=False)

          country  population      area    capital
0         Belgium        11.3   30510.0   Brussels
1          France        64.3  671308.0      Paris
2         Germany        81.3  357050.0     Berlin
3     Netherlands        16.9   41526.0  Amsterdam
4  United Kingdom        64.9  244820.0     London
0         Nigeria         NaN       NaN      Abuja
1          Rwanda         NaN       NaN     Kigali
2           Egypt         NaN       NaN      Cairo
3         Morocco         NaN       NaN      Rabat

### Combining columns  - ``pd.concat`` with ``axis=1``

Assume we have another DataFrame for the same countries, but with some additional statistics:

In [14]:
data = {'country': ['Belgium', 'France', 'Netherlands'],
        'GDP': [496477, 2650823, 820726],
        'area': [8.0, 9.9, 5.7]}
country_economics = pd.DataFrame(data).set_index('country')
country_economics

                 GDP  area
country
Belgium       496477   8.0
France       2650823   9.9
Netherlands   820726   5.7

## Joining data with `pd.merge`
Using `pd.concat` above, we combined datasets that had the same columns or the same index values. But, another typical case if where you want to add information of second dataframe to a first one based on one of the columns. That can be done with [`pd.merge`](http://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.merge.html).

Let's look again at the primary dataset, but taking a small subset of it to make the example easier to grasp:

In [44]:
df = pd.read_csv('data/primary.csv')

In [45]:
data = df.loc[:20,:]

In [17]:
data

           REGION      DISTRICT      MALE    FEMALE
0          ARUSHA  ARUSHA RURAL   32475.0   33698.0
1          ARUSHA  ARUSHA URBAN   36315.0   36993.0
2          ARUSHA        KARATU   23303.0   23181.0
3          ARUSHA       LONGIDO   10584.0    9045.0
4          ARUSHA          MERU   33854.0   34171.0
5          ARUSHA       MONDULI   13689.0   12888.0
6          ARUSHA    NGORONGORO   16017.0   12162.0
7   DAR ES SALAAM         ILALA   73129.0   78309.0
8   DAR ES SALAAM     KINONDONI   91554.0   93921.0
9   DAR ES SALAAM        TEMEKE   85118.0   88813.0
10         DODOMA          BAHI   15672.0   15967.0
11         DODOMA      CHAMWINO   26483.0   28264.0
12         DODOMA        CHEMBA       NaN       NaN
13         DODOMA  DODOMA URBAN   35137.0   36806.0
14         DODOMA        KONDOA   48859.0   55869.0
15         DODOMA        KONGWA   27169.0   30264.0
16         DODOMA       MPWAPWA   32176.0   31646.0
17          GEITA       BUKOMBE   39490.0   40178.0
18          GEITA         CHATO   39377.0   38393.0
19          GEITA         GEITA  115698.0  116328.0
20          GEITA   GEITA URBAN       NaN       NaN

Assume we have another dataframe with more information about the 'REGION' locations:

In [18]:
zones = pd.DataFrame({'REGION': ['ARUSHA', 'DAR ES SALAAM', 'DODOMA', 'GEITA'],
                          'ZONES': ['Northern zone', 'Costal zone', 'Central zone', 'Lake zone'],
                          'COUNTRY': ['Tanzania', 'Tanzania', 'Tanzania', 'Tanzania']})

In [19]:
zones

          REGION          ZONES   COUNTRY
0         ARUSHA  Northern zone  Tanzania
1  DAR ES SALAAM    Costal zone  Tanzania
2         DODOMA   Central zone  Tanzania
3          GEITA      Lake zone  Tanzania

We now want to add those columns to the data dataframe, for which we can use `pd.merge`, specifying the column on which we want to merge the two datasets:

In [32]:
pd.merge(data, zones, on='REGION', how='left')

           REGION      DISTRICT      MALE    FEMALE          ZONES   COUNTRY
0          ARUSHA  ARUSHA RURAL   32475.0   33698.0  Northern zone  Tanzania
1          ARUSHA  ARUSHA URBAN   36315.0   36993.0  Northern zone  Tanzania
2          ARUSHA        KARATU   23303.0   23181.0  Northern zone  Tanzania
3          ARUSHA       LONGIDO   10584.0    9045.0  Northern zone  Tanzania
4          ARUSHA          MERU   33854.0   34171.0  Northern zone  Tanzania
5          ARUSHA       MONDULI   13689.0   12888.0  Northern zone  Tanzania
6          ARUSHA    NGORONGORO   16017.0   12162.0  Northern zone  Tanzania
7   DAR ES SALAAM         ILALA   73129.0   78309.0    Costal zone  Tanzania
8   DAR ES SALAAM     KINONDONI   91554.0   93921.0    Costal zone  Tanzania
9   DAR ES SALAAM        TEMEKE   85118.0   88813.0    Costal zone  Tanzania
10         DODOMA          BAHI   15672.0   15967.0   Central zone  Tanzania
11         DODOMA      CHAMWINO   26483.0   28264.0   Central zone  Tanzania
12         DODOMA        CHEMBA       NaN       NaN   Central zone  Tanzania
13         DODOMA  DODOMA URBAN   35137.0   36806.0   Central zone  Tanzania
14         DODOMA        KONDOA   48859.0   55869.0   Central zone  Tanzania
15         DODOMA        KONGWA   27169.0   30264.0   Central zone  Tanzania
16         DODOMA       MPWAPWA   32176.0   31646.0   Central zone  Tanzania
17          GEITA       BUKOMBE   39490.0   40178.0      Lake zone  Tanzania
18          GEITA         CHATO   39377.0   38393.0      Lake zone  Tanzania
19          GEITA         GEITA  115698.0  116328.0      Lake zone  Tanzania
20          GEITA   GEITA URBAN       NaN       NaN      Lake zone  Tanzania

In this case we use `how='left` (a "left join") because we wanted to keep the original rows of `df` and only add matching values from `zones` to it. Other options are 'inner', 'outer' and 'right' (see the [docs](http://pandas.pydata.org/pandas-docs/stable/merging.html#brief-primer-on-merge-methods-relational-algebra) for more on this).

## Group by" operations
Consider the following data

When analyzing data, you often calculate summary statistics (aggregations like the mean, max, ...). As we have seen before, we can easily calculate such a statistic for a Series or column using one of the many available methods. For example:

In [33]:
df['FEMALE'].sum()

4160892.0

However, in many cases your data has certain groups in it, and in that case, you may want to calculate this statistic for each of the groups.

For example, in the above dataframe `df`,  REGION column has several possible values. When we want to calculate the sum for of FEMALE students in the three REGION, GEITA, DODOMA and ARUSHA, we could do the following:

In [34]:
for key in ['GEITA', 'DODOMA', 'ARUSHA']:
    print(key, df[df['REGION'] == key]['FEMALE'].sum())

GEITA 194899.0
DODOMA 198816.0
ARUSHA 162138.0

This becomes very verbose when having multiple groups. You could make the above a bit easier by looping over the different values, but still, it is not very convenient to work with.

What we did above, applying a function on different groups, is a "groupby operation", and pandas provides some convenient functionality for this.

The "group by" concept: we want to **apply the same function on subsets of your dataframe, based on some key to split the dataframe in subsets**

This operation is also referred to as the "split-apply-combine" operation, involving the following steps:

* **Splitting** the data into groups based on some criteria
* **Applying** a function to each group independently
* **Combining** the results into a data structure

<img src="img/splitApplyCombine.png">

Similar to SQL `GROUP BY`

In [35]:
df.groupby('REGION')[["FEMALE"]].sum()

                 FEMALE
REGION
ARUSHA         162138.0
DAR ES SALAAM  261043.0
DODOMA         198816.0
GEITA          194899.0
IRINGA         107414.0
KAGERA         227473.0
KATAVI          44976.0
KIGOMA         171069.0
KILIMANJARO    147679.0
LINDI           81271.0
MANYARA        124969.0
MARA           209713.0
MBEYA          275118.0
MOROGORO       202040.0
MTWARA         120962.0
MWANZA         327066.0
NJOMBE          79124.0
PWANI          111494.0
RUKWA           96255.0
RUVUMA         145041.0
SHINYANGA      153218.0
SIMIYU         145354.0
SINGIDA        126755.0
TABORA         206371.0
TANGA          240634.0

In the previous example, we  grouped by a single column by passing its name. But, a column name is not the only value you can pass as the grouper in `df.groupby(grouper)`. Other possibilities for `grouper` are:

- a list of strings (to group by multiple columns)
- a Series (similar to a string indicating a column in df) or array
- function (to be applied on the index)

In [36]:
df.groupby(['REGION', 'DISTRICT'])['FEMALE'].mean()

REGION         DISTRICT
ARUSHA         ARUSHA RURAL      33698.0
               ARUSHA URBAN      36993.0
               KARATU            23181.0
               LONGIDO            9045.0
               MERU              34171.0
               MONDULI           12888.0
               NGORONGORO        12162.0
DAR ES SALAAM  ILALA             78309.0
               KINONDONI         93921.0
               TEMEKE            88813.0
DODOMA         BAHI              15967.0
               CHAMWINO          28264.0
               CHEMBA                NaN
               DODOMA URBAN      36806.0
               KONDOA            55869.0
               KONGWA            30264.0
               MPWAPWA           31646.0
GEITA          BUKOMBE           40178.0
               CHATO             38393.0
               GEITA            116328.0
               GEITA URBAN           NaN
               MBOGWE                NaN
               NYANG'HWALE           NaN
IRINGA         IRINGA RURAL      28990.0
               IRINGA URBAN      13449.0
               KILOLO            30316.0
               MUFINDI           34659.0
KAGERA         BIHARAMULO        20865.0
               BUKOBA RURAL      28264.0
               BUKOBA URBAN      10654.0
                                  ...
SHINYANGA      USHETU                NaN
SIMIYU         BARIADI RURAL     79153.0
               BARIADI URBAN         NaN
               BUSEGA                NaN
               ITILIMA               NaN
               MASWA             33992.0
               MEATU             32209.0
SINGIDA        IKUNGI                NaN
               IRAMBA            40906.0
               MANYONI           24947.0
               MKALAMA               NaN
               SINGIDA RURAL     46895.0
               SINGIDA URBAN     14007.0
TABORA         IGUNGA            35892.0
               KALIUA                NaN
               NZEGA             50067.0
               SIKONGE           15217.0
               TABORA URBAN      23134.0
               URAMBO            45939.0
               UYUI              36122.0
TANGA          BUMBULI               NaN
               HANDENI           35379.0
               KILINDI           40330.0
               KOROGWE RURAL     25000.0
               KOROGWE URBAN      6057.0
               LUSHOTO           70238.0
               MKINGA            12568.0
               MUHEZA            19650.0
               PANGANI            4925.0
               TANGA URBAN       26487.0
Name: FEMALE, Length: 163, dtype: float64

Oftentimes you want to know how many elements there are in a certain group (or in other words: the number of occurences of the different values from a column).

To get the size of the groups, we can use `size`:

In [37]:
df.groupby('REGION').size()

REGION
ARUSHA            7
DAR ES SALAAM     3
DODOMA            7
GEITA             6
IRINGA            4
KAGERA            8
KATAVI            4
KIGOMA            7
KILIMANJARO       7
LINDI             6
MANYARA           6
MARA              8
MBEYA            10
MOROGORO          7
MTWARA            7
MWANZA            7
NJOMBE            6
PWANI             7
RUKWA             4
RUVUMA            6
SHINYANGA         7
SIMIYU            6
SINGIDA           6
TABORA            7
TANGA            10
dtype: int64

## Pivoting data

People who know Excel, probably know the **Pivot** functionality:
Reshape data (produce a “pivot” table) based on column values. Uses unique values from specified index / columns to form axes of the resulting DataFrame.

In [48]:
df = pd.DataFrame({'Month': ["January", "January", "January", "January", 
                                  "February", "February", "February", "February", 
                                  "March", "March", "March", "March"],
                   'Category': ["Transportation", "Grocery", "Household", "Entertainment",
                                "Transportation", "Grocery", "Household", "Entertainment",
                                "Transportation", "Grocery", "Household", "Entertainment"],
                   'Amount': [74., 235., 175., 100., 115., 240., 225., 125., 90., 260., 200., 120.]})

In [49]:
df

       Month        Category  Amount
0    January  Transportation    74.0
1    January         Grocery   235.0
2    January       Household   175.0
3    January   Entertainment   100.0
4   February  Transportation   115.0
5   February         Grocery   240.0
6   February       Household   225.0
7   February   Entertainment   125.0
8      March  Transportation    90.0
9      March         Grocery   260.0
10     March       Household   200.0
11     March   Entertainment   120.0

In [56]:
df.pivot(index="Month", columns="Category", values="Amount")

Category  Entertainment  Grocery  Household  Transportation
Month
February          125.0    240.0      225.0           115.0
January           100.0    235.0      175.0            74.0
March             120.0    260.0      200.0            90.0

In [64]:
df.pivot_table(index="Month", columns=None, values="Amount")

          Amount
Month
February  176.25
January   146.00
March     167.50

## Handling missing values with pandas

Before you start cleaning a data set, it’s a good idea to just get a general feel for the data. After that, you can put together a plan to clean the data.
I like to start by asking the following questions:
* What are the features?
* What are the expected types (int, float, string, boolean)?
* Is there obvious missing data (values that Pandas can detect)?
* Is there other types of missing data that’s not so obvious (can’t easily detect with Pandas)?

To show you what I mean, let’s start working through the example.

<img src="images/data.jpg">

This is a much smaller dataset than what you’ll typically work with. Even though it’s a small dataset, it highlights a lot of real-world situations that you will encounter.

A good way to get a quick feel for the data is to take a look at the first few rows. Here’s how you would do that in Pandas:

In [80]:
# Importing libraries
import pandas as pd
import numpy as np

# Read csv file into a pandas dataframe
d = pd.read_csv("data/property_data.csv")

# Take a look at the first few rows
d.head()

           PID  ST_NUM    ST_NAME OWN_OCCUPIED NUM_BEDROOMS NUM_BATH SQ_FT
0  100001000.0   104.0     PUTNAM            Y            3        1  1000
1  100002000.0   197.0  LEXINGTON            N            3      1.5    --
2  100003000.0     NaN  LEXINGTON            N          NaN        1   850
3  100004000.0   201.0   BERKELEY           12            1      NaN   700
4          NaN   203.0   BERKELEY            Y            3        2  1600


Now I can answer my original question, what are my features? It’s pretty easy to infer the following features from the column names:
* ST_NUM: Street number
* ST_NAME: Street name
* OWN_OCCUPIED: Is the residence owner occupied
* NUM_BEDROOMS: Number of bedroom

We can also answer, what are the expected types?
* ST_NUM: float or int… some sort of numeric type
* ST_NAME: string
* OWN_OCCUPIED: string… Y (“Yes”) or N (“No”)
* NUM_BEDROOMS: float or int, a numeric type


### Standard Missing Values
So what do I mean by “standard missing values”? These are missing values that Pandas can detect.
Going back to our original dataset, let’s take a look at the “Street Number” column.

Going back to our original dataset, let’s take a look at the “Street Number” column.
<img src="images/data2.jpg">

In the third row there’s an empty cell. In the seventh row there’s an “NA” value.

Clearly these are both missing values. Let’s see how Pandas deals with these.

In [81]:
# Looking at the ST_NUM column
print (d['ST_NUM'])
print ("###########")
print (d['ST_NUM'].isnull())

0    104.0
1    197.0
2      NaN
3    201.0
4    203.0
5    207.0
6      NaN
7    213.0
8    215.0
Name: ST_NUM, dtype: float64
###########
0    False
1    False
2     True
3    False
4    False
5    False
6     True
7    False
8    False
Name: ST_NUM, dtype: bool

Taking a look at the column, we can see that Pandas filled in the blank space with “NA”. Using the isnull() method, we can confirm that both the missing value and “NA” were recognized as missing values. Both boolean responses are True.

This is a simple example, but highlights an important point. Pandas will recognize both empty cells and “NA” types as missing values. In the next section, we’ll take a look at some types that Pandas won’t recognize

### Non-Standard Missing Values
Sometimes it might be the case where there’s missing values that have different formats.

Let’s take a look at the “Number of Bedrooms” column to see what I mean.

<img src="images/data2.jpg">

In this column, there’s four missing values.
* n/a
* NA
* —
* na

From the previous section, we know that Pandas will recognize “NA” as a missing value, but what about the others? Let’s take a look.

In [82]:
# Looking at the NUM_BEDROOMS column
print (d['NUM_BEDROOMS'])
print ("#############")
print (d['NUM_BEDROOMS'].isnull())

0      3
1      3
2    NaN
3      1
4      3
5    NaN
6      2
7      1
8     na
Name: NUM_BEDROOMS, dtype: object
#############
0    False
1    False
2     True
3    False
4    False
5     True
6    False
7    False
8    False
Name: NUM_BEDROOMS, dtype: bool

Just like before, Pandas recognized the “NA” as a missing value. Unfortunately, the other types weren’t recognized.

If there’s multiple users manually entering data, then this is a common problem. Maybe i like to use “n/a” but you like to use “na”.

An easy way to detect these various formats is to put them in a list. Then when we import the data, Pandas will recognize them right away. Here’s an example of how we would do that.

In [83]:
# Making a list of missing value types
missing_values = ["n/a", "na", "--"]
df = pd.read_csv("data/property_data.csv", na_values = missing_values)

In [85]:
# Looking at the NUM_BEDROOMS column
print (df['NUM_BEDROOMS'])
print (df['NUM_BEDROOMS'].isnull())

0    3.0
1    3.0
2    NaN
3    1.0
4    3.0
5    NaN
6    2.0
7    1.0
8    NaN
Name: NUM_BEDROOMS, dtype: float64
0    False
1    False
2     True
3    False
4    False
5     True
6    False
7    False
8     True
Name: NUM_BEDROOMS, dtype: bool

This time, all of the different formats were recognized as missing values.
You might not be able to catch all of these right away. As you work through the data and see other types of missing values, you can add them to the list.

It’s important to recognize these non-standard types of missing values for purposes of summarizing and transforming missing values. If you try and count the number of missing values before converting these non-standard types, you could end up missing a lot of missing values.

In the next section we’ll take a look at a more complicated, but very common, type of missing value.

From our previous examples, we know that Pandas will detect the empty cell in row seven in [own occupied] as a missing value. Let’s confirm with some code.

In [86]:
# Looking at the OWN_OCCUPIED column
print (df['OWN_OCCUPIED'])
print (df['OWN_OCCUPIED'].isnull())

0      Y
1      N
2      N
3     12
4      Y
5      Y
6    NaN
7      Y
8      Y
Name: OWN_OCCUPIED, dtype: object
0    False
1    False
2    False
3    False
4    False
5    False
6     True
7    False
8    False
Name: OWN_OCCUPIED, dtype: bool

In the fourth row, there’s the number 12. The response for Owner Occupied should clearly be a string (Y or N), so this numeric type should be a missing value.

This example is a little more complicated so we’ll need to think through a strategy for detecting these types of missing values. There’s a number of different approaches, but here’s the way that I’m going to work through this one.

* Loop through the OWN_OCCUPIED column
* Try and turn the entry into an integer
* If the entry can be changed into an integer, enter a missing value
* If the number can’t be an integer, we know it’s a string, so keep going

Let’s take a look at the code and then we’ll go through it in detail.

In [88]:
# Detecting numbers 
cnt=0
for row in df['OWN_OCCUPIED']:
    try:
        int(row)
        df.loc[cnt, 'OWN_OCCUPIED']=np.nan
    except ValueError:
        pass
    cnt+=1

### Summarizing Missing Values
After we’ve cleaned the missing values, we will probably want to summarize them.

For instance, we might want to look at the total number of missing values for each feature.

In [97]:
# Total missing values for each feature
df.isnull().sum()

PID             1
ST_NUM          2
ST_NAME         0
OWN_OCCUPIED    2
NUM_BEDROOMS    3
NUM_BATH        1
SQ_FT           2
dtype: int64

Other times we might want to do a quick check to see if we have any missing values at all.

In [96]:
# Any missing values?
df.isnull().values.any()

True

We might also want to get a total count of missing values.

In [98]:
# Total number of missing values
df.isnull().sum().sum()

11

Now that we’ve summarized the number of missing values, let’s take a look at doing some simple replacements.

### Replacing
Often times you’ll have to figure out how you want to handle missing values.
Sometimes you’ll simply want to delete those rows, other times you’ll replace them.

As I mentioned earlier, this shouldn’t be taken lightly. We’ll go over some basic imputations, but for a detailed statistical approach for dealing with missing data, [check out these awesome slides](https://github.com/matthewbrems/ODSC-missing-data-may-18/blob/master/Analysis%20with%20Missing%20Data.pdf) from data scientist Matt Brems.

That being said, maybe you just want to fill in missing values with a single value.

In [99]:
# Replace missing values with a number
df['ST_NUM'].fillna(125, inplace=True)

A very common way to replace missing values is using a median.

In [100]:
# Replace using median 
median = df['NUM_BEDROOMS'].median()
df['NUM_BEDROOMS'].fillna(median, inplace=True)

### Conclusion
Dealing with messy data is inevitable. Data cleaning is just part of the process on a data science project.
In this last section of notebook we went over some ways to detect, summarize, and replace missing values.


For even more resources about data cleaning, 


[check out these data science books](https://www.dataoptimal.com/data-science-books-2018/).